Revit 2018 API
DuctSizeSettings.Item Property
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public DuctSizes this[
	DuctShape ductShape
] { get; }
Visual Basic
Public ReadOnly Default Property Item ( _
	ductShape As DuctShape _
) As DuctSizes
	Get
Visual C++
public:
property DuctSizes^ default[DuctShape ductShape] {
	DuctSizes^ get (DuctShape ductShape);
}
Parameters
ductShape
Type: Autodesk.Revit.DB.Mechanical.DuctShape
See Also
DuctSizeSettings Class
Autodesk.Revit.DB.Mechanical Namespace